app/Controllers/Pendaftaran/Pendaftaran.php

SELECT COUNT(*) AS `numrows`
FROM `appointments`
WHERE `status` = 'approved'
AND `schedule_date` = '2026-02-11'
SELECT COUNT(*) AS `numrows`
FROM `appointments`
WHERE `status` = 'pending'
AND `schedule_date` = '2026-02-11'
SELECT COUNT(*) AS `numrows`
FROM `queues`
JOIN `appointments` ON `appointments`.`appointment_id` = `queues`.`appointment_id`
WHERE `appointments`.`schedule_date` = '2026-02-11'
SELECT `appointments`.`appointment_id`, `appointments`.`status`, `users`.`full_name`, `departments`.`name` AS `department_name`
FROM `appointments`
JOIN `patients` ON `patients`.`patient_id` = `appointments`.`patient_id`
JOIN `users` ON `users`.`user_id` = `patients`.`user_id`
JOIN `departments` ON `departments`.`department_id` = `appointments`.`department_id`
ORDER BY `appointments`.`created_at` DESC
 LIMIT 5
SELECT `queues`.`queue_number`, `queues`.`status`, `users`.`full_name`, `departments`.`name` AS `department_name`
FROM `queues`
JOIN `appointments` ON `appointments`.`appointment_id` = `queues`.`appointment_id`
JOIN `patients` ON `patients`.`patient_id` = `appointments`.`patient_id`
JOIN `users` ON `users`.`user_id` = `patients`.`user_id`
JOIN `departments` ON `departments`.`department_id` = `appointments`.`department_id`
ORDER BY `queues`.`queue_id` DESC
 LIMIT 5
---
    public function index()
    {
        $today = date('Y-m-d');

        // Total pendaftaran terkonfirmasi hari ini
        $totalConfirmed = $this->appointmentModel
            ->where('status', 'confirmed')
            ->where('schedule_date', $today)
            ->countAllResults();

        // Total menunggu verifikasi
        $totalWaiting = $this->appointmentModel
            ->where('status', 'waiting')
            ->where('schedule_date', $today)
            ->countAllResults();

        // Total antrian hari ini
        $totalQueue = $this->queueModel
            ->join('appointments', 'appointments.appointment_id = queues.appointment_id')
            ->where('appointments.schedule_date', $today)
            ->countAllResults();

        // Pendaftaran terbaru
        $pendaftaranTerbaru = $this->appointmentModel
            ->select('
                appointments.appointment_id,
                appointments.status,
                users.full_name,
                departments.name AS department_name
            ')
            ->join('patients', 'patients.patient_id = appointments.patient_id')
            ->join('users', 'users.user_id = patients.user_id')
            ->join('departments', 'departments.department_id = appointments.department_id')
            ->orderBy('appointments.created_at', 'DESC')
            ->findAll(5);

        // Antrian terbaru
        $antrianTerbaru = $this->queueModel
            ->select('
                queues.queue_number,
                queues.status,
                users.full_name,
                departments.name AS department_name
            ')
            ->join('appointments', 'appointments.appointment_id = queues.appointment_id')
            ->join('patients', 'patients.patient_id = appointments.patient_id')
            ->join('users', 'users.user_id = patients.user_id')
            ->join('departments', 'departments.department_id = appointments.department_id')
            ->orderBy('queues.queue_id', 'DESC')
            ->findAll(5);

SELECT `appointments`.`appointment_id`, `appointments`.`status`, `appointments`.`schedule_date`, `users`.`full_name`, `departments`.`name` AS `department_name`
FROM `appointments`
JOIN `patients` ON `patients`.`patient_id` = `appointments`.`patient_id`
JOIN `users` ON `users`.`user_id` = `patients`.`user_id`
JOIN `departments` ON `departments`.`department_id` = `appointments`.`department_id`
ORDER BY `appointments`.`created_at` DESC
---
    public function pasien()
    {
        $dataPasien = $this->appointmentModel
            ->select('
                appointments.appointment_id,
                appointments.status,
                appointments.schedule_date,
                users.full_name,
                departments.name AS department_name
            ')
            ->join('patients', 'patients.patient_id = appointments.patient_id')
            ->join('users', 'users.user_id = patients.user_id')
            ->join('departments', 'departments.department_id = appointments.department_id')
            ->orderBy('appointments.created_at', 'DESC')
            ->findAll();