app/Controllers/Admin/Admin.php

SELECT COUNT(*) AS `numrows`
FROM `appointments`
WHERE `schedule_date` = '2026-02-11'
SELECT COUNT(*) AS `numrows`
FROM `examinations`
SELECT COUNT(*) AS `numrows`
FROM `payments`
WHERE `payment_status` = 'paid'
SELECT COUNT(*) AS `numrows`
FROM `medicine_pickups`
SELECT `users`.`full_name` as `pasien`, `departments`.`name` as `poli`, `diagnosis`, `exam_date`
FROM `examinations`
JOIN `appointments` ON `appointments`.`appointment_id` = `examinations`.`appointment_id`
JOIN `patients` ON `patients`.`patient_id` = `appointments`.`patient_id`
JOIN `users` ON `users`.`user_id` = `patients`.`user_id`
JOIN `departments` ON `departments`.`department_id` = `appointments`.`department_id`
ORDER BY `exam_date` DESC
 LIMIT 5
---
    public function index()
    {
        $today = date('Y-m-d');

        $data = [
            'title'   => 'Dashboard Admin',
            'stats'   => [
                'pasien'      => $this->db->table('appointments')->where('schedule_date', $today)->countAllResults(),
                'pemeriksaan' => $this->db->table('examinations')->countAllResults(),
                'pembayaran'  => $this->db->table('payments')->where('payment_status', 'paid')->countAllResults(),
                'obat'        => $this->db->table('medicine_pickups')->countAllResults(),
            ],
            // Mengambil 5 aktivitas pemeriksaan terakhir
            'riwayat' => $this->db->table('examinations')
                ->select('users.full_name as pasien, departments.name as poli, diagnosis, exam_date')
                ->join('appointments', 'appointments.appointment_id = examinations.appointment_id')
                ->join('patients', 'patients.patient_id = appointments.patient_id')
                ->join('users', 'users.user_id = patients.user_id')
                ->join('departments', 'departments.department_id = appointments.department_id')
                ->orderBy('exam_date', 'DESC')
                ->limit(5)
                ->get()->getResultArray()

SELECT `appointments`.*, `users`.`full_name`, `departments`.`name` as `poli`, `d_user`.`full_name` as `nama_dokter`
FROM `appointments`
JOIN `patients` ON `patients`.`patient_id` = `appointments`.`patient_id`
JOIN `users` ON `users`.`user_id` = `patients`.`user_id`
JOIN `departments` ON `departments`.`department_id` = `appointments`.`department_id`
LEFT JOIN `doctors` ON `doctors`.`doctor_id` = `appointments`.`doctor_id`
LEFT JOIN `users` `d_user` ON `d_user`.`user_id` = `doctors`.`user_id`
---
    public function pendaftaran()
    {
        $db = \Config\Database::connect();

        // Query untuk mengambil data pendaftaran
        $data['pendaftaran'] = $db->table('appointments')
            ->select('appointments.*, users.full_name, departments.name as poli, d_user.full_name as nama_dokter')
            ->join('patients', 'patients.patient_id = appointments.patient_id')
            ->join('users', 'users.user_id = patients.user_id')
            ->join('departments', 'departments.department_id = appointments.department_id')
            ->join('doctors', 'doctors.doctor_id = appointments.doctor_id', 'left')
            ->join('users d_user', 'd_user.user_id = doctors.user_id', 'left')
            ->get()->getResultArray();