app/Controllers/Admin/Users.php

    public function index()
    {
        // Join tabel users dengan roles agar nama role muncul (bukan angka ID)
        $data['users'] = $this->userModel
            ->select('users.*, roles.role_name')
            ->join('roles', 'roles.role_id = users.role_id')
            ->findAll();
---
SELECT `users`.*, `roles`.`role_name`
FROM `users`
JOIN `roles` ON `roles`.`role_id` = `users`.`role_id`