app/Controllers/Pasien/Pasien.php

    private function getPatientId()
    {
        $userId = session()->get('user_id');

        if (!$userId) {
            return null;
        }

        $patient = $this->db->table('patients')
            ->where('user_id', $userId)
            ->get()
            ->getRow();
---
SELECT *
FROM `patients`
WHERE `user_id` = '15'

    public function booking()
    {
        $patientId = $this->getPatientId();

        if (!$patientId) {
            return redirect()->to('/login');
        }

        $data['departments'] = $this->db
            ->table('departments')
            ->get()
            ->getResult();
---
SELECT *
FROM `departments`

    public function store()
    {
        $patientId = $this->getPatientId();

        if (!$patientId) {
            return redirect()->to('/login');
        }

        $db = \Config\Database::connect();

        $departmentId = $this->request->getPost('department_id');

        // 🔍 Ambil 1 dokter berdasarkan poli
        $doctor = $db->table('doctors')
            ->where('department_id', $departmentId)
            ->get()
            ->getRow();

        if (!$doctor) {
            return redirect()->back()->with('error', 'Dokter untuk poli ini belum tersedia.');
        }

        $data = [
            'patient_id'    => $patientId,
            'schedule_date' => $this->request->getPost('schedule_date'),
            'department_id' => $departmentId,
            'doctor_id'     => $doctor->doctor_id,
            'status'        => 'waiting'
        ];

        $db->table('appointments')->insert($data);
---
SELECT *
FROM `doctors`
WHERE `department_id` = '1'
INSERT INTO `appointments` (`patient_id`, `schedule_date`, `department_id`, `doctor_id`, `status`) VALUES ('2', '2026-02-11', '1', '3', 'waiting')