app/Controllers/Apoteker.php

    public function index()
    {
        $data['resep'] = $this->prescription
            ->select('prescriptions.*, patients.patient_id')
            ->join('examinations', 'examinations.exam_id = prescriptions.exam_id')
            ->join('appointments', 'appointments.appointment_id = examinations.appointment_id')
            ->join('patients', 'patients.patient_id = appointments.patient_id')
            ->join('payments', 'payments.appointment_id = appointments.appointment_id')
            ->where('payments.payment_status', 'paid')
            ->whereNotIn(
                'prescriptions.prescription_id',
                function($builder) {
                    return $builder->select('prescription_id')->from('medicine_pickups');
                }
            )
            ->findAll();
---
SELECT `prescriptions`.*, `patients`.`patient_id`
FROM `prescriptions`
JOIN `examinations` ON `examinations`.`exam_id` = `prescriptions`.`exam_id`
JOIN `appointments` ON `appointments`.`appointment_id` = `examinations`.`appointment_id`
JOIN `patients` ON `patients`.`patient_id` = `appointments`.`patient_id`
JOIN `payments` ON `payments`.`appointment_id` = `appointments`.`appointment_id`
WHERE `payments`.`payment_status` = 'paid'
AND `prescriptions`.`prescription_id` NOT IN (SELECT `prescription_id` FROM `medicine_pickups`)