app/Controllers/Auth.php

    public function loginProcess()
    {
        $session = session();
        $model = new UserModel();

        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        // Ambil data user + nama rolenya (JOIN table)
        // Kita butuh nama role (misal: 'admin') untuk logika redirect
        $data = $model->select('users.*, roles.role_name')
            ->join('roles', 'roles.role_id = users.role_id')
            ->where('username', $username)
            ->first();
---
SELECT `users`.*, `roles`.`role_name`
FROM `users`
JOIN `roles` ON `roles`.`role_id` = `users`.`role_id`
WHERE `username` = 'nadia'
 LIMIT 1