app/Controllers/Apoteker/Apoteker.php

    public function pickup($id)
    {
        $db = \Config\Database::connect();
        $db->transStart(); // Mulai proteksi

        $items = $this->item->where('prescription_id', $id)->findAll();

        foreach ($items as $item) {
            $this->medicine->set('stock', 'stock - ' . $item['quantity'], false)
                ->where('medicine_id', $item['medicine_id'])
                ->update();
---
UPDATE `medicines` SET `stock` = stock - 1
WHERE `medicine_id` = '1'